src/InformationRegisters/ОперацииСПодключаемымОборудованием/ОперацииСПодключаемымОборудованием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперацииСПодключаемымОборудованием</name>
  <resources>
    <name>ВходящиеПараметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИсходящиеПараметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Результат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКомпонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РевизияИнтерфейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Милисекунда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГодМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОперацииСПодключаемымОборудованием/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОригиналВходящихПараметров = Истина;
	ОригиналИсходящихПараметров = Истина;
	ЗаполнитьПараметры();
	Если Запись.Результат Тогда
		Операция = Запись.Операция;
	Иначе
		Операция = СтрШаблон(НСтр("ru = '%1 (ошибка выполнения)';
									|en = '%1 (ошибка выполнения)'"), Запись.Операция);
	Конецесли;
	
	Если Запись.Результат Тогда
		Элементы.ГруппаОшибка.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ФормаСообщениеВТехПоддержку.Видимость = ОбщегоНазначенияБПО.ИспользуетсяСообщенияВСлужбуТехническойПоддержки()
			И ОбщегоНазначенияБПОСлужебныйВызовСервера.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОригиналВходящихПараметровПриИзменении(Элемент)
	Если ОригиналВходящихПараметров Тогда
		ВходящиеПараметры = ВходящиеПараметрыФормат;
	Иначе
		ВходящиеПараметры = Запись.ВходящиеПараметры;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОригиналИсходящихПараметровПриИзменении(Элемент)
	Если ОригиналИсходящихПараметров Тогда
		ИсходящиеПараметры = ИсходящиеПараметрыФормат;
	Иначе
		ИсходящиеПараметры = Запись.ИсходящиеПараметры;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииСПодключаемымОборудованием.ВходящиеПараметры КАК ВходящиеПараметры,
		|	ОперацииСПодключаемымОборудованием.ИсходящиеПараметры КАК ИсходящиеПараметры
		|ИЗ
		|	РегистрСведений.ОперацииСПодключаемымОборудованием КАК ОперацииСПодключаемымОборудованием
		|ГДЕ
		|	ОперацииСПодключаемымОборудованием.Оборудование = &Оборудование
		|	И ОперацииСПодключаемымОборудованием.Дата = &Дата
		|	И ОперацииСПодключаемымОборудованием.НомерОперации = &НомерОперации
		|	И ОперацииСПодключаемымОборудованием.ГодМесяц = &ГодМесяц";
	
	Запрос.УстановитьПараметр("ГодМесяц", Запись.ГодМесяц);
	Запрос.УстановитьПараметр("Дата", Запись.Дата);
	Запрос.УстановитьПараметр("НомерОперации", Запись.НомерОперации);
	Запрос.УстановитьПараметр("Оборудование", Запись.Оборудование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		//ВходящиеПараметрыОригинал = Выборка.ВходящиеПараметры.Получить();
		//ИсходящиеПараметрыОригинал = Выборка.ИсходящиеПараметры.Получить();
		Если ЗначениеЗаполнено(Запись.ВходящиеПараметры) Тогда
			ВходящиеПараметрыФормат = ЛогированиеОперацийБПО.ФорматПараметраЛогирования(Запись.ВходящиеПараметры);
		Иначе
			Элементы.ОригиналВходящихПараметров.Видимость = Ложь;
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.ИсходящиеПараметры) Тогда
			ИсходящиеПараметрыФормат = ЛогированиеОперацийБПО.ФорматПараметраЛогирования(Запись.ИсходящиеПараметры);
		Иначе
			Элементы.ОригиналИсходящихПараметров.Видимость = Ложь;
		КонецЕсли;
		
		ВходящиеПараметры = ВходящиеПараметрыФормат;
		ИсходящиеПараметры = ИсходящиеПараметрыФормат;
		//ВходящиеПараметры = УбратьМаскируемыеСимволы(Выборка.ВходящиеПараметры.Получить());
		//ИсходящиеПараметры = УбратьМаскируемыеСимволы(Выборка.ИсходящиеПараметры.Получить());
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти
